Updated Ingestion
